#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
random_id.db_suffix: Refreshing state... [id=1ktCfQ]
google_project_service.servicenetworking: Refreshing state... [id=fullstack-app-base/servicenetworking.googleapis.com]
google_project_service.artifactregistry: Refreshing state... [id=fullstack-app-base/artifactregistry.googleapis.com]
google_project_service.sts: Refreshing state... [id=fullstack-app-base/sts.googleapis.com]
google_project_service.compute: Refreshing state... [id=fullstack-app-base/compute.googleapis.com]
google_project_service.secretmanager: Refreshing state... [id=fullstack-app-base/secretmanager.googleapis.com]
google_project_service.sqladmin: Refreshing state... [id=fullstack-app-base/sqladmin.googleapis.com]
google_project_service.run: Refreshing state... [id=fullstack-app-base/run.googleapis.com]
google_project_service.iamcredentials: Refreshing state... [id=fullstack-app-base/iamcredentials.googleapis.com]
google_project_service.iam: Refreshing state... [id=fullstack-app-base/iam.googleapis.com]
google_compute_network.vpc: Refreshing state... [id=projects/fullstack-app-base/global/networks/fullstack-app-vpc]
google_project_service.redis: Refreshing state... [id=fullstack-app-base/redis.googleapis.com]
google_compute_global_address.private_ip_address: Refreshing state... [id=projects/fullstack-app-base/global/addresses/fullstack-app-private-ip]
google_service_account.cloud_run: Refreshing state... [id=projects/fullstack-app-base/serviceAccounts/fullstack-app-cloud-run-sa@fullstack-app-base.iam.gserviceaccount.com]
google_service_account.github_actions: Refreshing state... [id=projects/fullstack-app-base/serviceAccounts/fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com]
google_project_service.vpcaccess: Refreshing state... [id=fullstack-app-base/vpcaccess.googleapis.com]
google_artifact_registry_repository.backend: Refreshing state... [id=projects/fullstack-app-base/locations/asia-northeast1/repositories/backend]
google_iam_workload_identity_pool.github_actions: Refreshing state... [id=projects/fullstack-app-base/locations/global/workloadIdentityPools/fullstack-app-github-pool]
google_secret_manager_secret.flask_secret_key: Refreshing state... [id=projects/fullstack-app-base/secrets/fullstack-app-flask-secret-key]
google_secret_manager_secret.jwt_secret_key: Refreshing state... [id=projects/fullstack-app-base/secrets/fullstack-app-jwt-secret-key]
google_project_iam_member.cloud_sql_instance_user: Refreshing state... [id=fullstack-app-base/roles/cloudsql.instanceUser/serviceAccount:fullstack-app-cloud-run-sa@fullstack-app-base.iam.gserviceaccount.com]
google_project_iam_member.cloud_sql_client: Refreshing state... [id=fullstack-app-base/roles/cloudsql.client/serviceAccount:fullstack-app-cloud-run-sa@fullstack-app-base.iam.gserviceaccount.com]
google_secret_manager_secret_iam_member.jwt_secret_access: Refreshing state... [id=projects/fullstack-app-base/secrets/fullstack-app-jwt-secret-key/roles/secretmanager.secretAccessor/serviceAccount:fullstack-app-cloud-run-sa@fullstack-app-base.iam.gserviceaccount.com]
google_secret_manager_secret_version.jwt_secret_key: Refreshing state... [id=projects/853642690014/secrets/fullstack-app-jwt-secret-key/versions/1]
google_project_iam_member.github_actions_security_admin: Refreshing state... [id=fullstack-app-base/roles/iam.securityAdmin/serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com]
google_project_iam_member.github_actions_compute_network_admin: Refreshing state... [id=fullstack-app-base/roles/compute.networkAdmin/serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com]
google_project_iam_member.github_actions_service_usage_admin: Refreshing state... [id=fullstack-app-base/roles/serviceusage.serviceUsageAdmin/serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com]
google_project_iam_member.github_actions_service_account_key_admin: Refreshing state... [id=fullstack-app-base/roles/iam.serviceAccountKeyAdmin/serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com]
google_project_iam_member.github_actions_secret_manager_admin: Refreshing state... [id=fullstack-app-base/roles/secretmanager.admin/serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com]
google_project_iam_member.github_actions_sa_user: Refreshing state... [id=fullstack-app-base/roles/iam.serviceAccountUser/serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com]
google_project_iam_member.github_actions_artifact_registry_repo_admin: Refreshing state... [id=fullstack-app-base/roles/artifactregistry.repoAdmin/serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com]
google_secret_manager_secret_version.flask_secret_key: Refreshing state... [id=projects/853642690014/secrets/fullstack-app-flask-secret-key/versions/1]
google_secret_manager_secret_iam_member.flask_secret_access: Refreshing state... [id=projects/fullstack-app-base/secrets/fullstack-app-flask-secret-key/roles/secretmanager.secretAccessor/serviceAccount:fullstack-app-cloud-run-sa@fullstack-app-base.iam.gserviceaccount.com]
google_service_networking_connection.private_vpc_connection: Refreshing state... [id=projects%2Ffullstack-app-base%2Fglobal%2Fnetworks%2Ffullstack-app-vpc:servicenetworking.googleapis.com]
google_sql_database_instance.main: Refreshing state... [id=fullstack-app-db-d64b427d]
google_sql_database.database: Refreshing state... [id=projects/fullstack-app-base/instances/fullstack-app-db-d64b427d/databases/app_db]
google_sql_user.iam_user: Refreshing state... [id=fullstack-app-cloud-run-sa/%/fullstack-app-db-d64b427d]
google_sql_user.user: Refreshing state... [id=app_user//fullstack-app-db-d64b427d]
google_vpc_access_connector.connector: Refreshing state... [id=projects/fullstack-app-base/locations/asia-northeast1/connectors/fullstack-app-vpc-conn]
google_cloud_run_v2_job.db_migrate: Refreshing state... [id=projects/fullstack-app-base/locations/asia-northeast1/jobs/fullstack-app-db-migrate]
google_cloud_run_service.backend: Refreshing state... [id=locations/asia-northeast1/namespaces/fullstack-app-base/services/fullstack-app-backend]
google_cloud_run_service_iam_member.public_access: Refreshing state... [id=v1/projects/fullstack-app-base/locations/asia-northeast1/services/fullstack-app-backend/roles/run.invoker/allUsers]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform planned the following actions, but then encountered a problem:

  # google_cloud_run_service.backend will be updated in-place
  ~ resource "google_cloud_run_service" "backend" {
        id                         = "locations/asia-northeast1/namespaces/fullstack-app-base/services/fullstack-app-backend"
        name                       = "fullstack-app-backend"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ metadata {
              ~ labels           = {
                  - "client.knative.dev/nonce"            = "uwyysjrefq" -> null
                    # (4 unchanged elements hidden)
                }
                name             = null
                # (6 unchanged attributes hidden)
            }
          ~ spec {
                # (5 unchanged attributes hidden)

              ~ containers {
                    name        = null
                    # (4 unchanged attributes hidden)

                  # Warning: this block will be marked as sensitive and will not
                  # display in UI output after applying this change.
                  ~ env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                  # Warning: this block will be marked as sensitive and will not
                  # display in UI output after applying this change.
                  ~ env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                  # Warning: this block will be marked as sensitive and will not
                  # display in UI output after applying this change.
                  ~ env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                  # Warning: this block will be marked as sensitive and will not
                  # display in UI output after applying this change.
                  ~ env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                  # Warning: this block will be marked as sensitive and will not
                  # display in UI output after applying this change.
                  ~ env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                  # Warning: this block will be marked as sensitive and will not
                  # display in UI output after applying this change.
                  ~ env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                  # Warning: this block will be marked as sensitive and will not
                  # display in UI output after applying this change.
                  ~ env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                  # Warning: this block will be marked as sensitive and will not
                  # display in UI output after applying this change.
                  ~ env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                  # Warning: this block will be marked as sensitive and will not
                  # display in UI output after applying this change.
                  ~ env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                  + env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                  + env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                  + env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                  + env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }

                    # (3 unchanged blocks hidden)
                }
            }
        }

        # (2 unchanged blocks hidden)
    }

  # google_cloud_run_v2_job.db_migrate will be updated in-place
  ~ resource "google_cloud_run_v2_job" "db_migrate" {
      - client                   = "gcloud" -> null
      - client_version           = "545.0.0" -> null
        id                       = "projects/fullstack-app-base/locations/asia-northeast1/jobs/fullstack-app-db-migrate"
        name                     = "fullstack-app-db-migrate"
        # (24 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_project_iam_member.github_actions_artifact_registry_writer will be created
  + resource "google_project_iam_member" "github_actions_artifact_registry_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com"
      + project = "fullstack-app-base"
      + role    = "roles/artifactregistry.writer"
    }

  # google_project_iam_member.github_actions_cloud_run_developer will be created
  + resource "google_project_iam_member" "github_actions_cloud_run_developer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com"
      + project = "fullstack-app-base"
      + role    = "roles/run.developer"
    }

  # google_project_iam_member.github_actions_cloud_sql_editor will be created
  + resource "google_project_iam_member" "github_actions_cloud_sql_editor" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com"
      + project = "fullstack-app-base"
      + role    = "roles/cloudsql.editor"
    }

  # google_project_iam_member.github_actions_iam_role_viewer will be created
  + resource "google_project_iam_member" "github_actions_iam_role_viewer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com"
      + project = "fullstack-app-base"
      + role    = "roles/iam.roleViewer"
    }

  # google_project_iam_member.github_actions_service_account_creator will be created
  + resource "google_project_iam_member" "github_actions_service_account_creator" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com"
      + project = "fullstack-app-base"
      + role    = "roles/iam.serviceAccountCreator"
    }

  # google_project_iam_member.github_actions_servicenetworking_admin will be created
  + resource "google_project_iam_member" "github_actions_servicenetworking_admin" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com"
      + project = "fullstack-app-base"
      + role    = "roles/servicenetworking.networksAdmin"
    }

  # google_project_iam_member.github_actions_storage_object_admin will be created
  + resource "google_project_iam_member" "github_actions_storage_object_admin" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com"
      + project = "fullstack-app-base"
      + role    = "roles/storage.objectAdmin"
    }

  # google_project_iam_member.github_actions_vpcaccess_admin will be created
  + resource "google_project_iam_member" "github_actions_vpcaccess_admin" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:fullstack-app-github-actions@fullstack-app-base.iam.gserviceaccount.com"
      + project = "fullstack-app-base"
      + role    = "roles/vpcaccess.admin"
    }

  # google_redis_instance.rate_limiter will be created
  + resource "google_redis_instance" "rate_limiter" {
      + alternative_location_id     = (known after apply)
      + auth_enabled                = true
      + auth_string                 = (sensitive value)
      + authorized_network          = "projects/fullstack-app-base/global/networks/fullstack-app-vpc"
      + connect_mode                = "DIRECT_PEERING"
      + create_time                 = (known after apply)
      + current_location_id         = (known after apply)
      + display_name                = "Rate Limiter Redis"
      + effective_labels            = {
          + "app"                        = "fullstack-app"
          + "environment"                = "production"
          + "goog-terraform-provisioned" = "true"
          + "managed_by"                 = "terraform"
          + "purpose"                    = "rate-limiting"
        }
      + effective_reserved_ip_range = (known after apply)
      + host                        = (known after apply)
      + id                          = (known after apply)
      + labels                      = {
          + "app"         = "fullstack-app"
          + "environment" = "production"
          + "managed_by"  = "terraform"
          + "purpose"     = "rate-limiting"
        }
      + location_id                 = (known after apply)
      + maintenance_schedule        = (known after apply)
      + maintenance_version         = (known after apply)
      + memory_size_gb              = 1
      + name                        = "fullstack-app-rate-limiter"
      + nodes                       = (known after apply)
      + persistence_iam_identity    = (known after apply)
      + port                        = (known after apply)
      + project                     = "fullstack-app-base"
      + read_endpoint               = (known after apply)
      + read_endpoint_port          = (known after apply)
      + read_replicas_mode          = (known after apply)
      + redis_version               = "REDIS_7_0"
      + region                      = "asia-northeast1"
      + replica_count               = (known after apply)
      + reserved_ip_range           = (known after apply)
      + secondary_ip_range          = (known after apply)
      + server_ca_certs             = (known after apply)
      + terraform_labels            = {
          + "app"                        = "fullstack-app"
          + "environment"                = "production"
          + "goog-terraform-provisioned" = "true"
          + "managed_by"                 = "terraform"
          + "purpose"                    = "rate-limiting"
        }
      + tier                        = "BASIC"
      + transit_encryption_mode     = "DISABLED"

      + maintenance_policy {
          + create_time = (known after apply)
          + update_time = (known after apply)

          + weekly_maintenance_window {
              + day      = "SUNDAY"
              + duration = (known after apply)

              + start_time {
                  + hours   = 3
                  + minutes = 0
                  + nanos   = 0
                  + seconds = 0
                }
            }
        }

      + persistence_config (known after apply)
    }

Plan: 9 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  + redis_auth_string                    = (sensitive value)
  + redis_host                           = (known after apply)
  + redis_port                           = (known after apply)

Error: Error when reading or editing IAMBetaWorkloadIdentityPool "projects/fullstack-app-base/locations/global/workloadIdentityPools/fullstack-app-github-pool": googleapi: Error 403: Permission 'iam.workloadIdentityPools.get' denied on resource '//iam.googleapis.com/projects/fullstack-app-base/locations/global/workloadIdentityPools/fullstack-app-github-pool' (or it may not exist).
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ErrorInfo",
    "domain": "iam.googleapis.com",
    "metadata": {
      "permission": "iam.workloadIdentityPools.get",
      "resource": "projects/fullstack-app-base/locations/global/workloadIdentityPools/fullstack-app-github-pool"
    },
    "reason": "IAM_PERMISSION_DENIED"
  }
]

  with google_iam_workload_identity_pool.github_actions,
  on iam.tf line 186, in resource "google_iam_workload_identity_pool" "github_actions":
 186: resource "google_iam_workload_identity_pool" "github_actions" {


```

</details>

*Pusher: @TomokiIshimine, Action: `pull_request`, Workflow: `Terraform`*